Documents/ВСД2_ОбновитьТранспорт.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ВСД2_ОбновитьТранспорт</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_ХозСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_ХозСубъект</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получатель_Площадка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВСДВходящие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Перегрузка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТтнНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокВСД</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.кб99_ВСД2</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТочки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>UUID</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТранспорта</Name>
							<Type>
								<v8:Type>cfg:EnumRef.кб99_ТипыТранспорта</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерАвто</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>45</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>номерПрицепа</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>номерВагона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерАвиарейса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НазваниеСудна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>45</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>номерКонтейнера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>25</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>250</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Площадка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВСД_Площадка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВСД2_ОбновитьТранспорт/Ext/ObjectModule.bsl
// GRACE:MODULE_START name="ОбновлениеТранспорта"
// @grace-module: ОбновлениеТранспорта
// @grace-purpose: Объектный модуль документа ВСД2_ОбновитьТранспорт — заполнение точек маршрута из ВСД при создании документа
// @grace-depends: ОбновлениеТранспорта, ЯдроВСД
// @grace-version: 1.0
// @grace-contract-ref: docs/Contracts.xml -> module="ОбновлениеТранспорта"

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Если ЗначениеЗаполнено(ДанныеЗаполнения) Тогда
		ПараметрыДокумента = ДанныеЗаполнения.ПараметрыДокумента;
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ПараметрыДокумента);
		ЭтотОбъект.Получатель_ХозСубъект = Получатель_Площадка.ХозСубъект;

		ДокВСД = ДанныеЗаполнения.ДокВсд;

		Если ДанныеЗаполнения.Свойство("ТочкиМаршрута") Тогда
			Для Каждого ТочкаМаршрута Из ДанныеЗаполнения.ТочкиМаршрута Цикл
				новаяТочка = ЭтотОбъект.ВСДВходящие.Добавить();
				новаяТочка.ДокВСД = ДокВСД;
				новаяТочка.Имя = ТочкаМаршрута.Название;
				ЗаполнитьЗначенияСвойств(новаяТочка, точкаМаршрута);
			КонецЦикла;
		Иначе
			тзМаршрутДоставки = ДокВСД.ТочкиМаршрута.Выгрузить();
			Для Каждого точкаМаршрута из тзМаршрутДоставки Цикл
				Если точкаМаршрута.Перегрузка Тогда
					новаяТочка = ЭтотОбъект.ВСДВходящие.Добавить();
					новаяТочка.ДокВСД = ДокВСД;
					ЗаполнитьЗначенияСвойств(новаяТочка, точкаМаршрута);
					ЗаполнитьЗначенияСвойств(новаяТочка, ДанныеЗаполнения.НомерАвто);
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		ВСДВходящие.Сортировать("НомерТочки");
	КонецЕсли;

КонецПроцедуры
// GRACE:MODULE_END name="ОбновлениеТранспорта"
